<template>
  <Modal v-model="visiable" :mask-closable="false" width="850" @on-visible-change="close">
    <p slot="header" style="text-align:center">
      {{type === 1 ? '运掌柜服务协议' : '运掌柜隐私协议'}}
    </p>

    <div v-if="type === 1">
      <h2>提示条款：</h2><br>
      您的信任对我们非常重要，我们深知个人信息对您的重要性，我们将按法律法规要求，采取相应安全保护措施，尽力保护您的个人信息安全可控。有鉴于此，运掌柜和服务提供者（或简称“我们”）制定本《隐私政策》（下称“本政策”）并提醒您：<br>
      本政策适用于运掌柜产品及服务，包括运掌柜官网及运掌柜开放平台、运掌柜网页版及客户端、运掌柜自有品牌的智能硬件以及将运掌柜部分功能/服务作为第三方服务集成在运掌柜关联公司（见定义条款）和/或其他第三方智能硬件、软件或服务中。如我们关联公司（范围详见定义部分）的产品或服务中使用了运掌柜提供的产品或服务但未设独立的隐私政策的，则本政策同样适用于该部分产品或服务。<br>
      需要特别说明的是，本隐私政策不适用于其他第三方通过前述网页或客户端向您提供的服务。例如您通过运掌柜开放平台下载使用的第三方应用或者依托运掌柜产品向您提供服务时，您向第三方提供的信息不适用本政策。<br>
      在使用运掌柜产品或服务前，请您务必仔细阅读并透彻理解本政策，在确认充分理解并同意后使用相关产品或服务。一旦您开始使用运掌柜产品或服务，即表示您已充分理解并同意本政策。<br><br>
      <h2>第一部分 定义</h2><br>
      运掌柜服务：是指南京运掌柜信息科技有限公司旗下的运掌柜服务提供者开发、运营的旨在解决中国物流企业管理货物运输管理、仓储管理的一些列管理多端平台及客户端。包括运掌柜官网及运掌柜开放平台、运掌柜网页版及客户端、运掌柜自有品牌的智能硬件以及将运掌柜部分功能/服务作为第三方服务集成在运掌柜关联公司（见定义条款）和/或其他第三方软件和/或智能硬件而提供的服务。<br>
      运掌柜服务提供者：是指研发并提供运掌柜产品和服务的南京运掌柜信息科技有限公司，以下简称“运掌柜”。<br>
      个人信息：指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。<br>
      个人敏感信息：包括身份证件号码、手机号码、银行账号、行踪轨迹、交易信息、14岁以下（含）儿童的个人信息等。<br>
      个人信息删除：指在实现日常业务功能所涉及的系统中去除个人信息的行为，使其保持不可被检索、访问的状态。<br><br>
      <h2>第二部分 法律声明</h2><br>
      <h3>一、权利归属</h3><br>
      运掌柜的Logo、“运掌柜”等文字、图形及其组合，以及运掌柜其他标识、徽记、运掌柜服务的名称等为运掌柜及其关联公司在中国和其他国家的注册商标。未经运掌柜书面授权，任何人不得以任何方式展示、使用或做其他处理（包括但不限于复制、传播、展示、镜像、上传、下载），也不得向他人表明您有权展示、使用或做其他处理。
      运掌柜所有的产品、服务、技术与所有应用程序或其组件/功能（以下或简称“技术服务”）的知识产权均归属于运掌柜所有或归其权利人所有。<br>
      除非另行声明，运掌柜拥有运掌柜在网站内发布文档等信息（包括但不限于文字、图形、图片、照片、音频、视频、图标、色彩、版面设计、电子文档）的所有权利（包括但不限于版权、商标权、专利权、商业秘密和其他所有相关权利）。未经运掌柜许可，任何人不得擅自使用如上内容（包括但不限于通过程序或设备监视、复制、转播、展示、镜像、上传、下载网站内的任何内容）。被授权浏览、复制、打印和传播属于运掌柜产品和服务内信息内容的，该等内容都不得用于商业目的且所有信息内容及其任何部分的使用都必须包括此权利声明。<br><br>
      <h3>二、责任限制</h3><br>
      运掌柜用户在运掌柜移动客户端、官方主页、论坛、社区以及开放平台上自行上传、提供、发布相关信息，包括但不限于用户名称、公司名称、 联系人及联络信息，相关图片、资讯等，该等信息均由用户自行提供，运掌柜用户须对其提供的任何信息依法承担全部责任。<br>
      运掌柜转载作品（包括论坛内容）出于传递更多信息之目的，并不意味运掌柜赞同其观点或证实其内容的真实性。<br>
      运掌柜在此提示，您在使用运掌柜产品及服务期间应当遵守中华人民共和国的法律，不得危害网络安全，不得利用运掌柜产品及服务从事侵犯他人名誉、隐私、知识产权和其他合法权益的活动。尽管有前述提示，运掌柜不对您使用运掌柜产品及服务的用途和目的承担任何责任。<br><br>
      <h2>第三部分 隐私政策</h2><br>
      本隐私政策部分将帮助您了解以下内容：<br>
      1、我们如何收集和使用您的个人信息<br>
      2、我们如何使用Cookie和同类技术<br>
      3、我们如何共享、转让、公开披露您的个人信息<br>
      4、我们如何保护您的个人信息<br>
      5、我们如何处理未成年人的个人信息<br>
      6、您的个人信息如何在全球范围转移<br>
      7、本隐私政策如何更新<br>
      8、如何联系我们<br><br>
      <h3>一、我们如何收集和使 用您的个人信息</h3><br>
      (一) 我们如何收集您的信息<br>
      我们会出于本政策所述的以下目的，收集和使用您的个人信息：<br>
      1.帮助您成为运掌柜用户<br>
      为成为运掌柜会员，以便我们为您提供会员服，您需要提供手机号码、姓名、身份证信息、行业类型、企业名称、企业地址等基本信息，并创建运掌柜账号和密码。<br>
      2.向您提供产品或服务<br>
      1)您向我们提供的信息<br>
      在服务使用过程中，您可以对运掌柜产品及服务的体验问题反馈，帮助我们更好地了解您使用我们产品或服务的体验和需求，改善我们产品或服务。<br>
      您可以通过运掌柜为其他人订购产品或服务，您需要提供该实际订购人的前述个人信息。向我们提供该实际订购人的前述个人信息之前，您需确保您已经取得其授权同意。若前述个人不同意，我们将不对该个人可能造成的侵权承当相应法律责任。<br>
      2)我们在您使用服务过程中收集的信息<br>
      为向您提供更契合您需求的智能硬件和/或软件、页面展示和搜索结果、了解产品适配性、识别账号异常状态，我们会收集关于您使用产品、服务以及使用方式的信息并将这些信息进行关联，这些信息包括：<br>
      设备信息：我们会根据您在软件安装及使用中授予的具体权限，接收并记录您所使用的设备相关信息（例如设备型号、操作系统版本、设备设置、唯一设备标识符等软硬件特征信息）、设备所在位置相关信息（例如IP地址、GPS/北斗位置信息以及能够提供相关信息的Wi-Fi接入点、蓝牙和基站等传感器信息）。<br>
      日志信息：当您使用我们的网站或客户端提供的产品或服务时，我们会自动收集您对我们服务的详细使用情况，作为有关网络日志保存。例如您的搜索查询内容、IP地址、浏览器的类型、电信运营商、使用的语言、访问日期和时间、您访问的网页记录、通话状态信息等。<br>
      请注意，单独的设备信息、日志信息等是无法识别特定自然人身份的信息。如果我们将这类非个人信息与其他信息结合用于识别特定自然人身份，或者将其与个人信息结合使用，则在结合使用期间，这类非个人信息将被视为个人信息，除取得您授权或法律法规另有规定外，我们会将该类个人信息做匿名化、去标识化处理。<br>
      为展示您账号的订单信息，我们会收集您在使用我们服务过程中产生的订单信息用于向您展示及便于您对订单进行管理。<br>
      当您与我们联系时，我们可能会保存您的通信/通话记录和内容或您留下的联系方式等信息，以便与您联系或帮助您解决问题，或记录相关问题的处理方案及结果。<br>
      3)我们在您使用个性推荐服务过程中收集的信息<br>
      为向您提供更好、更个性化的服务，例如在不同的服务端或设备上提供更个性化但体验一致的服务，更契合您需求的输入推荐、客服接待或信息推送，了解产品适配性，识别账号异常状态，我们会收集您使用服务的相关信息，这些信息包括：设备信息、日志、服务使用信息。<br>
      日志：当您使用我们的网页或客户端时，我们会自动收集您对我们服务的详细使用情况，作为有关网络日志保存。例如您的IP地址、浏览器的类型、电信运营商、使用的语言、访问日期和时间以及访问时长、软硬件特征信息、您需求的网页记录及运掌柜服务Cookies信息，等。<br>
      服务使用信息：我们会记录您在使用运掌柜产品及服务时提交或产生的信息、通过钉盘存储的信息、其他关联公司中转的方式传输的文件、创建的好友列表、设置信息（例如记住密码、自动登录、通用设置、隐私设置、消息提示）等。<br>
      当您在使用运掌柜服务执行某些操作时（例如货物开始承运时），我们可能会向您或其他人（司机或者收货人）发送通知；<br>
      对于您在运掌柜开放平台开通使用的第三方应用服务，我们将在您启动该应用时收集相关信息，并按照本隐私权政策进行处理；第三方应用服务提供者可能会获取您使用运掌柜服务的相关个人信息，该第三方应用服务对您的个人信息的收集（如有）则受该第三方隐私权政策约束。<br>
      4) 第三方向我们提供的信息<br>
      运掌柜将对其他用户进行与您相关的操作时收集关于您的信息，亦可能从运掌柜关联公司、合作第三方或通过其他合法途径获取的您的个人数据信息。<br>
      3.为您提供安全保障<br>
      为预防、发现、调查欺诈、侵权、危害安全、非法或违反与我们或与我们关联公司的协议、政策或规则的行为，我们可能收集或整合您的用户信息、服务使用信息、设备信息、日志信息以及我们关联公司、合作伙伴取得您授权或依据法律共享的信息。<br>
      4.其他用途<br>
      我们将基于本政策未载明的其他特定目的收集您的信息时，会事先征求您的同意。<br>
      运掌柜收集及使用上述信息的目的是为了更好地经营运掌柜产品和服务（包括但不限于向您提供个性化的服务），并且会通过包括但不限于通过网站通知、电子邮件、电话或短信息等方式通知运掌柜不会查看或者使用您通过运掌柜等服务存储的任何业务数据。
      如我们停止运营运掌柜产品或服务，我们将及时停止继续收集您个人信息的活动，将停止运营的通知以逐一送达或公告的形式通知您，对所持有的个人信息进行删除或匿名化处理。<br>
      (二) 我们如何使用您的信息<br>
      收集您的信息是为了向您提供服务及提升服务质量，为了实现这一目的，我们会把您的信息用于下列用途：<br>
      1、向您提供您使用的运掌柜产品或服务，并维护、改进、优化这些服务及服务体验；<br>
      2、为预防、发现、调查欺诈、侵权、危害安全、非法或违反与我们或与我们关联公司的协议、政策或规则的行为，保护您、其他用户或公众，我们或我们关联公司的合法权益，我们可能使用或整合您的用户信息、服务使用信息、设备信息、日志信息以及我们关联公司、合作伙伴取得您授权或依据法律共享的信息，来综合判断您账户及交易风险、进行身份验证、检测及防范安全事件，并依法采取必要的记录、审计、分析、处置措施；<br>
      3、我们可能会将您的信息进行处理或者与来自其他服务的信息结合起来，用于为了向您提供更加个性化的服务使用，例如向您推荐可能感兴趣的内容，包括但不限于向您发出产品和服务信息，或通过系统向您展示个性化的第三方推广信息，或者在征得您同意的情况下与运掌柜合作伙伴共享信息以便他们向您发送有关其产品和服务的信息；<br>
      4、经您许可的其他用途。<br><br>
      <h3>二、我们如何使用 Cookie 和同类技术</h3><br>
      为使您获得更轻松的访问体验，您使用运掌柜产品或服务时，我们可能会通过采用各种技术收集和存储您访问运掌柜服务的相关数据，在您访问或再次访问运掌柜服务时,我们能识别您的身份，并通过分析数据为您提供更好更多的服务。包括使用小型数据文件识别您的身份，这么做是为了解您的使用习惯，帮您省去重复输入账户信息的步骤，或者帮助判断您的账户安全。这些数据文件可能是Cookie、Flash Cookie，或您的浏览器或关联应用程序提供的其他本地存储（统称“Cookie”）。<br>
      请您理解，我们的某些服务只能通过使用Cookie才可得到实现。如果您的浏览器或浏览器附加服务允许，您可以修改对Cookie的接受程度或者拒绝运掌柜的Cookie，但拒绝运掌柜的Cookie在某些情况下您可能无法使用依赖于cookies的运掌柜服务的部分功能。<br>
      网页上常会包含一些电子图像，称为“单像素 GIF 文件”或“网络 beacon”，它可以帮助网站计算浏览网页的用户或访问某些cookie。我们会通过网络beacon收集您浏览网页活动信息，例如您访问的页面地址、您先前访问的援引页面的位址、您停留在页面的时间、您的浏览环境以及显示设定等。<br><br>
      <h3>三、我们如何共享、转让、公开披露您的信息</h3><br>
      (一) 共享<br>
      我们不会与运掌柜服务提供者以外的公司、组织和个人共享您的个人信息，但以下情况除外：<br>
      1、在获取明确同意的情况下共享：获得您的明确同意后，我们会与其他方共享您的个人信息。<br>
      2、在法定情形下的共享：我们可能会根据法律法规规定、诉讼争议解决需要，或按行政、司法机关依法提出的要求，对外共享您的个人信息。<br>
      3、只有透露您的资料，才能提供您所要求的产品和服务，如使用忘记密码服务，您通过验证码确认的手机号码，将传送至基础电信业务运营商以实现通信，并接收短信验证码<br>
      4、在您被他人投诉侵犯知识产权或其他合法权利时，需要向投诉人披露您的必要资料，以便进行投诉处理的；<br>
      5、与关联公司间共享：为便于我们基于关联账号共同向您提供服务，推荐您可能感兴趣的信息或保护运掌柜关联公司或其他用户或公众的人身财产安全免遭侵害，您的个人信息可能会与我们的关联公司共享。我们只会共享必要的个人信息（如为便于您使用运掌柜账号使用我们关联公司产品或服务，我们会向关联公司共享您必要的账号信息），如果我们共享您的个人敏感信息或关联公司改变个人信息的使用及处理目的，将再次征求您的授权同意。<br>
      6、与授权合作伙伴共享：仅为实现本隐私政策中声明的目的，我们的某些服务将由我们和授权合作伙伴共同提供。我们可能会与合作伙伴共享您的某些个人信息，以提供更好的客户服务和用户体验。我们仅会出于合法、正当、必要、特定、明确的目的共享您的个人信息，并且只会共享提供服务所必要的个人信息。我们的合作伙伴无权将共享的个人信息用于与产品或服务无关的其他用途。<br>
      运掌柜服务含有到其他网站的链接。除法律另有规定外，运掌柜对其他网站的隐私保护措施不负任何责任。我们可能在任何需要的时候增加商业伙伴或共用品牌的网站，但是提供给他们的将仅是综合信息，我们将不会公开您的身份。<br>
      (二) 转让<br>
      我们不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外：<br>
      1、在获取明确同意的情况下转让：获得您的明确同意后，我们会向其他方转让您的个人信息。<br>
      2、在运掌柜服务提供者发生合并、收购或破产清算情形，或其他涉及合并、收购或破产清算情形时，如涉及到个人信息转让，我们会要求新的持有您个人信息的公司、组织继续受本政策的约束，否则我们将要求该公司、组织和个人重新向您征求授权同意。<br>
      (三) 公开披露<br>
      我们仅会在以下情况下，公开披露您的个人信息：<br>
      1、获得您明确同意或基于您的主动选择，我们可能会公开披露您的个人信息；<br>
      2、如果我们确定您出现违反法律法规或严重违反运掌柜相关协议规则的情况，或为保护运掌柜及其关联公司用户或公众的人身财产安全免遭侵害，我们可能依据法律法规或运掌柜相关协议规则征得您同意的情况下披露关于您的个人信息，包括相关违规行为以及运掌柜已对您采取的措施。<br>
      (四) 共享、转让、公开披露个人信息时事先征得授权同意的例外<br>
      以下情形中，共享、转让、公开披露您的个人信息无需事先征得您的授权同意：<br>
      1、与国家安全、国防安全有关的；<br>
      2、与公共安全、公共卫生、重大公共利益有关的；<br>
      3、与犯罪侦查、起诉、审判和判决执行等有关的；<br>
      4、出于维护您或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；<br>
      5、您自行向社会公众公开的个人信息；<br>
      6、从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道。<br>
      根据法律规定，共享、转让经去标识化处理的个人信息，且确保数据接收方无法复原并重新识别个人信息主体的，不属于个人信息的对外共享、转让及公开披露行为，对此类数据的保存及处理将无需另行向您通知并征得您的同意。<br><br>
      <h3>四、我们如何保护您的信息</h3><br>
      我们会采取各种预防措施来保护您的个人信息，以保障您的个人信息免遭丢失、盗用和误用，以及被擅自取阅、披露、更改或销毁。为确保您个人信息的安全，我们有严格的信息安全规定和流程，并有专门的信息安全团队在公司内部严格执行上述措施。<br>
      运掌柜有行业先进的以数据为核心，围绕数据生命周期进行的数据安全管理体系，从组织建设、制度设计、人员管理、产品技术等方面多维度提升整个系统的安全性。<br>
      我们会采取合理可行的措施，尽力避免收集无关的个人信息，并在限于达成本政策所述目的所需的期限内保留您的个人信息，除非需要延长保留期限或在法律的允许期限内。<br>
      在不幸发生个人信息安全事件后，我们将按照法律法规的要求【并最迟不迟于30 个自然日内】向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。事件相关情况我们将以邮件、信函、电话、推送通知等方式告知您，难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。同时，我们还将按照监管部门要求，上报个人信息安全事件的处置情况。<br>
      互联网环境并非百分之百安全，尽管我们有这些安全措施，但请注意在互联网上不存在“完善的安全措施”，我们将尽力确保您的信息的安全性。<br><br>
      <h3>五、您的个人信息如何在全球范围转移</h3><br>
      原则上，我们在中华人民共和国境内运营中收集和产生的个人信息，存储在中国人民共和国境内。就中华人民共和国境外运掌柜用户使用运掌柜产品及服务过程中产生的个人信息，您同意回传存储在中国境内的服务器上，否则您无法使用现有运掌柜的产品及服务。<br>在此类情况下，我们会确保您的个人信息得到在中华人民共和国境内足够同等的保护。<br><br>
      <h3>六、本政策如何更新</h3><br>
      我们的隐私政策可能变更。<br>
      未经您明确同意我们不会限制您按照本隐私政策所应享有的权利。我们会在运掌柜官方主页上公告发布对本隐私政策所做的任何变更。<br>
      对于重大变更，我们还会提供更为显著的通知（包括我们会通过运掌柜公示的方式进行意见征集、公告通知甚至向您提供弹窗提示）。<br>
      本政策所指的重大变更包括但不限于：<br>
      1、我们的服务模式发生重大变化。如处理用户信息的目的、用户信息的使用方式等；<br>
      2、我们在控制权、组织架构等方面发生重大变化。如业务调整、破产并购等引起的所有者变更等；<br>
      3、用户信息共享、转让或公开披露的主要对象发生变化；<br>
      4、我们负责处理用户信息安全的责任部门、联络方式及投诉渠道发生变化时；<br>
      5、用户信息安全影响评估报告表明存在高风险时。
    </div>

    <div v-else>
      <h2>欢迎使用运掌柜产品及服务！</h2><br>
      提示：在使用运掌柜及服务之前，您应当认真阅读并遵守《运掌柜服务协议》（以下简称“本协议”）以及《运掌柜隐私权政策》。请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款、争议解决和法律适用条款。免除或者限制责任的条款可能将以加粗字体显示，您应重点阅读。<br>
      当您按照注册页面提示填写信息、阅读并同意本协议且完成全部注册程序后，或您按照激活页面提示填写信息、阅读并同意本协议且完成全部激活程序后，或您以其他运掌柜允许的方式实际使用本服务时，即表示您已充分阅读、理解并接受本协议的全部内容，本协议即产生法律约束力。您承诺接受并遵守本协议的约定，届时您不应以未阅读本协议的内容或者未获得运掌柜对您问询的解答等理由，主张本协议无效，或要求撤销本协议。<br>
      <br><h2>一、缔约主体</h2><br>
      本协议由通过运掌柜网站、移动客户端及PC端运掌柜应用软件、硬件以及其他方式使用运掌柜服务的用户（以下简称“用户”或“您”）与南京运掌柜信息科技有限公司（以下简称“运掌柜”）共同缔结。<br>
      <br><h2>二、协议内容和效力</h2><br>
      1、本协议内容包括本协议正文及所有运掌柜已经发布或将来可能发布的隐私权政策、各项政策、规则、声明、通知、警示、提示、说明（以下简称“规则”）。前述规则为本协议不可分割的组成部分，与本协议具有同等法律效力。<br>
      2、运掌柜有权根据需要不时制订、修改本协议及相关规则，变更后的协议和规则一经公布，立即取代原协议及规则并自动生效。如您不同意相关变更，应当立即停止使用运掌柜服务，如您继续使用运掌柜服务或进行任何网站活动，即表示您已接受经修订的协议和规则。<br>
      <br><h2>三、服务内容</h2><br>
      1、运掌柜产品和服务包括运掌柜官网及运掌柜开放平台、运掌柜网页版及客户端、运掌柜自有品牌的智能硬件以及将运掌柜部分功能/服务作为第三方服务集成在运掌柜关联公司和/或其他第三方智能硬件、软件或服务中并向您提供的服务（“本服务”，具体以运掌柜提供的为准）。运掌柜会不断丰富您使用本服务的终端、形式等，如您已注册使用一种形式的服务，则可以以同一账号使用其他服务，本协议自动适用于您对所有版本的软件和服务的使用。<br>
      2、运掌柜依据本协议、《运掌柜隐私权政策》以及其他适用的规则，许可您对运掌柜软件进行不可转让的、非排他性的使用。您可以制作本软件的一个副本，仅用作备份。备份副本必须包含原软件中含有的所有著作权信息，本条及本协议其他条款未明示授权的其他一切权利仍由运掌柜保留，您在行使这些权利时须另外取得运掌柜的书面许可。运掌柜如果未行使前述任何权利，并不构成对该权利的放弃。<br>
      3、运掌柜有权自行决定对服务或服务任何部分及其相关功能、应用软件进行变更、升级、修改、转移，并在运掌柜官网上公示通知。<br>
      4、经企业组织书面授权，您可以代表企业组织申请管理员账号，通过运掌柜审核之后可通过该管理员账号上传和管理您所在企业组织的企业组织通信录，邀请企业通讯录内的企业组织成员加入相应企业组织群组，并通过运掌柜服务实现企业组织内部成员沟通、工作互动、协同智能办公等。企业组织及授权企业管理员在对您的企业组织成员进行身份管理之前，应向您的企业组织成员充分说明基于企业管理需求所开通的运掌柜相关服务。<br>
      5、如果您在使用本服务时接受邀请成为某个企业组织的成员并维持该身份时，您可以享受运掌柜为该企业组织及其成员提供的工作圈服务内容，包括成员通信录、语音服务、应用服务等。您所在企业组织及其管理员基于企业管理需求，对您的企业组织成员身份及基于该身份的相关权益进行管理，包括但不限于加入、删除以及调整权限和限制服务内容等。您保证在遵守运掌柜服务规范的同时，按照企业组织的授权范围和规范使用运掌柜服务。<br>
      <br><h2>四、注册及账号管理</h2><br>
      1、您确认，在您完成注册程序或以其他运掌柜允许的方式实际使用服务时，您应当是具备完全民事权利能力和与所从事的民事行为相适应的行为能力的自然人、法人或其他组织。若您不具备前述主体资格，请勿使用服务，否则您及您的监护人应承担因此而导致的一切后果，且运掌柜有权注销（永久冻结）您的账户，并向您及您的监护人索偿。如您代表一家企业、组织机构或其他法律主体进行注册或以其他运掌柜允许的方式实际使用本服务，则您声明和保证，您已经获得充分授权并有权代表该公司、组织机构或法律主体注册使用运掌柜，并受本协议地约束。<br>
      2、您可以使用您提供或确认的手机号或者运掌柜允许的其它方式作为账号进行注册, 您注册时应提交真实、准确、完整和反映当前情况的身份及其他相关信息，同时系统将为你自动分配一个运掌柜号。你理解并同意，您承诺注册的账号名称、设置的运掌柜号、头像等信息中不得出现违法和不良信息，不得冒充他人，不得未经许可为他人注册，不得以可能导致其他用户误认的方式注册账号或设置运掌柜号，不得使用可能侵犯他人权益的用户名（包括但不限于涉嫌商标权、名誉权侵权等），否则运掌柜有权不予注册或停止服务并收回账号及运掌柜号，因此产生的损失由您自行承担。<br>
      3、您了解并同意，运掌柜注册账号（包括客户端账号及服务管理账号）所有权归属于运掌柜，注册完成后，您仅获得账号使用权。运掌柜账号使用权仅归属于初始申请注册人，不得以任何方式转让或被提供予他人使用，否则，运掌柜有权立即不经通知收回该账号，由此带来的因您使用本服务产生的全部数据、信息等被清空、丢失等的损失，您应自行承担。<br>
      4、在您成功注册后，运掌柜将根据您的身份要素识别您的身份和授权登录。“身份要素”包括但不限于您的账户名称、密码、短信校验码、手机号码、身份证件号码及人脸信息、眼纹信息。您同意基于不同的终端以及您的使用习惯，运掌柜可能采取不同的验证措施识别您的身份。例如您的账户在新设备首次登录的，我们可能通过密码加短信校验码或人脸验证的方式确认您的身份。请您务必妥善保管您的终端及账户、密码和/或身份要素信息，并对利用该账户和密码/身份信息所进行的一切活动（包括但不限于网上点击同意或提交各类规则协议或购买服务、分享资讯或图片等）负全部责任。您承诺，在密码或账户遭到未获授权的使用，或者发生其他任何安全问题时，将立即通知运掌柜，且您同意并确认，除法律另有规定外，运掌柜不对上述情形产生的任何直接或间接的遗失或损害承担责任。除非有法律规定或司法裁定，且征得运掌柜的同意，否则，您的账户、密码不得以任何方式转让、赠与或继承（与账户相关的财产权益除外）。<br>
      5、您了解并同意，如您注册运掌柜账号后连续超过12个月未登录，运掌柜为优化管理等目的，有权回收该账号。<br>
      6、如您注销运掌柜或停止使用服务时，运掌柜有权自行对账号相关内容及信息以包括但不限于删除等方式进行处理，且无需就此向用户承担任何责任；如果账号为管理员账号，运掌柜有权取消和删除该管理员账号以及通信录成员基于该企业的一切信息和相关权益，包括但不限于解除与企业之间的服务关系、解散企业通信录、取消通信录成员与该企业相关的权益、删除管理员账号中的所有信息、删除企业通信录成员基于企业的所有信息等，您或你您代表的企业组织也有义务及时删去存储在运掌柜服务器上的所有企业信息。<br>
      <br><h2>五、服务使用规范</h2><br>
      1、用户充分了解并同意，运掌柜仅为用户提供服务平台，您应自行对利用服务从事的所有行为及结果承担责任。相应地，您应了解，使用运掌柜服务可能发生来自他人非法或不当行为（或信息）的风险，您应自行判断及行动，并自行承担相应的风险。<br>
      2、您应自行承担因使用服务所产生的费用，包括但不限于上网流量费、通信服务费等。<br>
      3、除非另有说明，本协议项下的服务只能用于非商业用途。您承诺不对本服务任何部分或本服务之使用或获得，进行复制、拷贝、出售、转售或用于包括但不限于广告及任何其它商业目的。<br>
      4、您承诺不会利用本服务进行任何违法或不当的活动，包括但不限于下列行为:<br>
      4.1 上载、传送或分享含有下列内容之一的信息：(a) 反对宪法所确定的基本原则的；(b) 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；(c) 损害国家荣誉和利益的；(d) 煽动民族仇恨、民族歧视、破坏民族团结的；(e) 破坏国家宗教政策，宣扬邪教和封建迷信的；(f) 散布谣言，扰乱社会秩序，破坏社会稳定的；(g) 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；(h) 侮辱或者诽谤他人，侵害他人合法权利的；(i) 含有虚假、诈骗、有害、胁迫、侵害他人隐私、骚扰、侵害、中伤、粗俗、猥亵、或其它道德上令人反感的内容；(j) 含有中国或其您所在国国家管辖法所适用的法律、法规、规章、条例以及任何具有法律效力之规范所限制或禁止的其它内容的；<br>
      4.2 冒充任何人或机构，或以虚伪不实的方式陈述或谎称与任何人或机构有关；<br>
      4.3 因本服务并非为某些特定目的而设计，您不可将本服务用于包括但不限于核设施、军事用途、医疗设施、交通通讯等重要领域。如果因为软件或服务的原因导致上述操作失败而带来的人员伤亡、财产损失和环境破坏等，运掌柜不承担法律责任；<br>
      4.4 违反遵守法律法规、社会主义制度、国家利益、公民合法利益、公共秩序、社会道德风尚和信息真实性等“七条底线”要求的行为；<br>
      4.5 从事任何违反中国法律、法规、规章、政策及规范性文件的行为。<br>
      5、您承诺不对本软件和服务从事以下行为：<br>
      5.1 将有关干扰、破坏或限制任何计算机软件、硬件或通讯设备功能的软件病毒或其他计算机代码、档案和程序之资料，加以上载、张贴、发送电子邮件或以其他方式传送；<br>
      5.2 干扰或破坏本服务或与本服务相连线之服务器和网络，或违反任何关于本服务连线网络之规定、程序、政策或规范；<br>
      5.3 通过修改或伪造软件运行中的指令、数据，增加、删减、变动软件的功能或运行效果，或者将用于上述用途的软件、方法进行运营或向公众传播，无论这些行为是否为商业目的；<br>
      5.4 通过非运掌柜开发、授权的第三方软件、插件、外挂、系统，登录或使用软件及服务，或制作、发布、传播上述工具；<br>
      5.5 自行、授权他人或利用第三方软件对本软件及其组件、模块、数据等进行干扰。<br>
      6、您承诺，使用运掌柜服务时您将严格遵守本协议。<br>
      7、您同意并接受运掌柜无须时时监控您上载、传送或分享的资料及信息，但运掌柜有权对您使用服务的情况进行审查、监督并采取相应行动，包括但不限于删除信息、中止或终止服务，及向有关机关报告。<br>
      8、您承诺不以任何形式使用本服务侵犯运掌柜的商业利益，或从事任何可能对运掌柜造成损害或不利于运掌柜的行为。<br>
      9、您了解并同意，在运掌柜服务提供过程中，运掌柜及其关联公司自行或由其他第三方合作伙伴向您发送广告、推广或宣传信息（包括商业或非商业信息）。运掌柜依照法律的规定对广告商履行相关义务（包括向您提供选择关闭广告信息的功能），您应当自行判断广告信息的真实性可可靠性并为自己的判断行为负责，除法律明确规定外，您因依该广告信息进行的交易或前述广告商提供的内容而遭受的损失或损害，运掌柜不承担责任。<br>
      10、如您申请服务管理账号，则应自行通过账号添加和管理成员，并对管理成员的行为自行承担责任，运掌柜根据您服务管理账号的行为对成员服务的调整亦由您承担后果，因此给运掌柜或他人造成损失的，您应当予以赔偿。<br>
      11、您充分了解并同意，您必须为自己注册帐号下的一切行为负责，包括您所发表的任何内容以及由此产生的任何后果。您应对使用本服务时接触到的内容自行加以判断，并承担因使用内容而引起的所有风险，包括因对内容的正确性、完整性或实用性的依赖而产生的风险。运掌柜无法且不会对您因前述风险而导致的任何损失或损害承担责任。<br>
      12、如果运掌柜发现或收到他人举报您有违反本协议约定的，运掌柜有权不经通知随时对相关内容进行删除、屏蔽，并采取包括但不限于收回账号，限制、暂停、终止您使用部分或全部本服务，追究法律责任等措施。<br>
      <br><h2>六、服务费用</h2><br>
      1、本服务的任何免费试用或免费功能和服务不应视为运掌柜放弃后续收费的权利。运掌柜有权提前7天在运掌柜官网上以公告的形式通知您收费标准。若您继续使用本服务，则需按运掌柜公布的收费标准支付相应费用。<br>
      2、所有费用需通过运掌柜接受的支付方式事先支付。前述使用费不包含其它任何税款、费用或相关汇款等支出，否则您应补足付款或自行支付该费用。<br>
      3、运掌柜有权根据实际情况提前7天单方调整费用标准及收费方式，并以公告形式通知您，而无需获得您的事先同意，如您不同意收费应当立即停止服务的使用，否则使用则视为您已同意并应当缴纳费用。<br>
      4、您应当自行支付使用本服务可能产生的上网费以及其他第三方收取的通讯费、信息费等。<br>
      <br><h2>七、特别授权</h2><br>
      1、当您向运掌柜关联公司作出任何形式的承诺，且相关公司已确认您违反了该承诺，则运掌柜有权立即按您的承诺约定的方式对您的账户采取限制措施，包括但不限于中止或终止向您提供服务，并公示相关公司确认的您的违约情况。您了解并同意，运掌柜无须就相关确认与您核对事实，或另行征得您的同意，且运掌柜无须就此限制措施或公示行为向您承担任何的责任。<br>
      2、一旦您违反本协议，或与运掌柜签订的其他协议的约定，运掌柜有权以任何方式通知运掌柜关联公司，要求其对您的权益采取限制措施，包括但不限于要求运掌柜关联公司中止、终止对您提供部分或全部服务，且在其经营或实际控制的任何网站公示您的违约情况。<br>
      <br><h2>八、第三方应用及服务</h2><br>
      1、运掌柜允许第三方应用接入服务平台，您可以在运掌柜直接获得包括但不限于OA软件等第三方应用服务（具体以您所在企业组织选择开通为准）。您了解并同意，运掌柜仅作为平台提供者，相关应用由该第三方独立提供，除法律法规和本协议另有规定外，运掌柜不对您对该应用的使用承担任何责任。<br>
      2、您了解并同意，如运掌柜对服务或其部分做出调整、中止或终止而对第三方应用服务产生影响，运掌柜不承担任何责任。<br>
      3、您通过第三方应用或服务使用运掌柜时，运掌柜可能会调用第三方系统或者通过第三方支持您的使用或访问，使用或访问的结果由该第三方提供。<br>
      4、您理解并同意，您在使用运掌柜服务中的第三方应用及服务时，除遵守本协议的约定外，还应遵守第三方用户协议；为实现第三方应用及服务，企业服务管理员基于企业组织授权择开通第三方服务，向该独立第三方提供企业通讯录信息。<br>
      <br><h2>九、服务中止或终止</h2><br>
      1、鉴于互联网服务的特殊性，运掌柜有权对服务内容进行变更，也可能会中断、中止或终止全部或者任一部分的服务，包括免费服务和/或收费服务，并在运掌柜官网上以公示的形式通知您。<br>
      2、您了解并同意，运掌柜可能定期或不定期地对提供网络服务的平台设备、设施和软硬件进行维护或检修，如因此类情况而造成收费服务在合理时间内中止，运掌柜无需承担责任，但应事先在运掌柜官网以公示的形式通告您。<br>
      3、如存在下列违约情形之一，运掌柜可立即对用户中止或终止服务，并要求用户赔偿损失：<br>
      3.1 用户违反第四条之注册义务；<br>
      3.2 用户使用收费网络服务时未按规定支付相应服务费；<br>
      3.3 用户违反第五条服务使用规范之规定。<br>
      <br><h2>十、隐私政策</h2><br>
      1、您在运掌柜服务注册的账户具有密码保护功能，以确保您基本信息资料的安全，请您妥善保管账户及密码信息。<br>
      2、运掌柜努力采取各种合理的物理、电子和管理方面的安全措施来保护您的信息，使您存储在运掌柜中的信息和通信内容不会被泄漏、毁损或者丢失，包括但不限于SSL、信息加密存储、数据中心的访问控制。我们对可能接触到信息的员工或外包人员也采取了严格管理，包括但不限于根据岗位的不同采取不同的权限控制，与他们签署保密协议，监控他们的操作情况等措施。运掌柜会按现有技术提供相应的安全措施来保护您的信息，提供合理的安全保障，运掌柜将在任何时候尽力做到使您的信息不被泄漏、毁损或丢失，但同时也请您注意在信息网络上不存在绝对完善的安全措施，请妥善保管好相关信息。<br>
      3、您应当保管好终端、账号及密码，并妥善保管相关信息和内容。因您自身原因导致的数据丢失或被盗以及在本软件及服务中相关数据的删除或储存失败的责任由您自行承担。<br>
      4、其他隐私条款见《运掌柜隐私协议》。<br>
      <br><h2>十一、知识产权</h2><br>
      1、您了解及同意，除非运掌柜另行声明，本协议项下服务包含的所有产品、技术、软件、程序、数据及其他信息（包括但不限于文字、图像、图片、照片、音频、视频、图表、色彩、版面设计、电子文档）的所有知识产权（包括但不限于版权、商标权、专利权、商业秘密等）及相关权利均归运掌柜或其关联公司所有。<br>
      2、您应保证，除非取得运掌柜书面授权，对于上述权利您不得（并不得允许任何第三人）实施包括但不限于出租、出借、出售、散布、复制、修改、转载、汇编、发表、出版、还原工程、反向汇编、反向编译，或以其它方式发现原始码等的行为。<br>
      3、运掌柜服务涉及的Logo、“运掌柜”等文字、图形及其组成，以及运掌柜其他标识、徵记、产品和服务名称均为运掌柜及其关联公司在中国和其它国家的商标，用户未经运掌柜书面授权不得以任何方式展示、使用或作其他处理，也不得向他人表明您有权展示、使用、或作其他处理。<br>
      4、您理解并同意授权运掌柜在宣传和推广中使用您的名称、商标、标识，但仅限于表明您属于我们的客户或合作伙伴。<br>
      <br><h2>十二、有限责任</h2><br>
      1、服务将按"现状"和按"可得到"的状态提供。运掌柜在此明确声明对服务不作任何明示或暗示的保证，包括但不限于对服务的可适用性，没有错误或疏漏，持续性，准确性，可靠性，适用于某一特定用途之类的保证，声明或承诺。<br>
      2、运掌柜对服务所涉的技术和信息的有效性，准确性，正确性，可靠性，质量，稳定，完整和及时性均不作承诺和保证。<br>
      3、不论在何种情况下，运掌柜均不对由于Internet连接故障，电脑，通讯或其他系统的故障，电力故障，罢工，劳动争议，暴乱，起义，骚乱，生产力或生产资料不足，火灾，洪水，风暴，爆炸，不可抗力，战争，政府行为，国际、国内法院的命令或第三方的不作为而造成的不能服务或延迟服务承担责任。<br>
      4、不论是否可以预见，不论是源于何种形式的行为，运掌柜不对由以下原因造成的任何特别的，直接的，间接的，惩罚性的，突发性的或有因果关系的损害或其他任何损害（包括但不限于利润或利息的损失，营业中止，资料灭失）承担责任。<br>
      4.1 使用或不能使用服务；<br>
      4.2 通过服务购买或获取任何产品，样品，数据，信息或进行交易等，或其他可替代上述行为的行为而产生的费用；<br>
      4.3 未经授权的存取或修改数据或数据的传输；<br>
      4.4 第三方通过服务所作的陈述或行为；<br>
      4.5 其它与服务相关事件，包括疏忽等，所造成的损害。<br>
      5、您充分了解并同意，鉴于互联网体制及环境的特殊性，您在服务中分享的信息及个人资料有可能会被他人复制、转载、擅改或做其它非法用途；您在此已充分意识此类风险的存在，并确认此等风险应完全由您自行承担，运掌柜对此不承担任何责任。<br>
      6、您了解并同意，在使用服务过程中可能存在来自任何他人的包括威胁性的、诽谤性的、令人反感的或非法的内容或行为或对他人权利的侵犯（包括知识产权）及匿名或冒名的信息的风险，基于服务使用规范所述，该等风险应由您自行承担，运掌柜对此不承担任何责任。<br>
      <br><h2>十三、违约责任及赔偿</h2><br>
      1、如果运掌柜发现或收到他人举报您有违反本协议约定的，运掌柜有权不经通知随时对相关内容进行删除、屏蔽，并采取包括但不限于限制、暂停、终止您使用运掌柜账号及服务，限制、暂停、终止您使用部分或全部本服务（包括但不限于解除与团体或成员的所属关系，删除通信录、限制增加成员、限制发送消息或添加好友等），追究法律责任等措施。<br>
      2、您同意，由于您通过服务上载、传送或分享之信息、使用本服务其他功能、违反本协议、或您侵害他人任何权利因而衍生或导致任何第三人向运掌柜及其关联公司提出任何索赔或请求，或运掌柜及其关联公司因此而发生任何损失，您同意将足额进行赔偿（包括但不限于合理律师费）。<br>
      <br><h2>十四、有效通知</h2><br>
      1、运掌柜向您发出的任何通知，可采用电子邮件、页面公开区域公告、个人网络区域提示、手机短信或常规信件等方式，且该等通知应自发送之日视为已向用户送达或生效。<br>
      2、您同意，您向运掌柜发出的任何通知应发至运掌柜对外正式公布或以第十六条所述方式告知用户的线上或线下联系方式、通信地址、电子邮件、等联系信息，或使用其他运掌柜认可的其他通知方式进行送达。<br>
      <br><h2>十五、争议解决及其他</h2><br>
      1、如本协议的任何条款被视作无效或无法执行，则上述条款可被分离，其余部份则仍具有法律效力。<br>
      2、运掌柜于用户过失或违约时放弃本协议规定的权利的，不得视为其对用户的其他或以后同类之过失或违约行为弃权。<br>
      3、本协议应取代双方此前就本协议任何事项达成的全部口头和书面协议、安排、谅解和通信。<br>
      4、您理解并同意，运掌柜有权自主决定经营策略并根据业务调整情况将本协议项下的全部权利义务一并转移给其关联公司，转让将以本协议规定的方式通知，用户承诺对此不持有异议。<br>
      (完)

    </div>

    <div slot="footer" style="text-align: center;">
      <Button  type="primary"  @click="close">确定</Button>
    </div>
  </Modal>
</template>

<script>
import BaseDialog from '@/basic/BaseDialog'
export default {
  name: 'Protocol',
  mixins: [ BaseDialog ],
  data () {
    return {

    }
  }
}

</script>
<style lang='stylus' scoped>
</style>
